; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	p2-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s0)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	(at package4 s2)
	(at package5 s0)
	(at package6 s2)
	(at package7 s1)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 87)
	(= (time-to-drive s1 s0) 87)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 66)
	(= (time-to-drive s2 s1) 66)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 41)
	(= (time-to-drive s0 s2) 41)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s1)
	(at truck1 s0)
	(at truck2 s0)
	(at truck3 s0)
	(at package1 s2)
	(at package2 s1)
	(at package3 s2)
	(at package4 s2)
	(at package5 s0)
	(at package7 s0)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 5 of 12
2. (load-truck package7 truck1 s1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 12
3. (walk driver3 s0 p1-0)
   deleted: (at driver3 s0)
   added: (at driver3 p1-0)
   goals met: 5 of 12
4. (load-truck package1 truck1 s1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 5 of 12
5. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 1131
   goals met: 6 of 12
6. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 6 of 12
7. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 1131 to 1787
   goals met: 5 of 12
8. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 6 of 12
9. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 12
10. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 7 of 12
11. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 12
12. (unload-truck package7 truck1 s2)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 12
13. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 7 of 12
14. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   goals met: 7 of 12
15. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   goals met: 8 of 12
16. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 12
17. (drive-truck truck2 s0 s2 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 1787 to 2197
   goals met: 6 of 12
18. (load-truck package7 truck2 s2)
   deleted: (at package7 s2)
   added: (in package7 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 12
19. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 2197 to 2648
   goals met: 7 of 12
20. (unload-truck package7 truck2 s0)
   deleted: (in package7 truck2)
   added: (at package7 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 8 of 12
21. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   goals met: 7 of 12
22. (walk driver1 p1-2 s2)
   deleted: (at driver1 p1-2)
   added: (at driver1 s2)
   goals met: 7 of 12
23. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 12
24. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 2648 to 3308
   goals met: 7 of 12
25. (drive-truck truck2 s0 s2 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 3308 to 3718
   goals met: 6 of 12
26. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 3718 to 4588
   goals met: 7 of 12
27. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 7 of 12
28. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 7 of 12
29. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 12
30. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 4588 to 4998
   goals met: 8 of 12
31. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 9 of 12
32. (walk driver3 p1-0 s0)
   deleted: (at driver3 p1-0)
   added: (at driver3 s0)
   goals met: 9 of 12
33. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 9 of 12
34. (drive-truck truck3 s0 s2 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 4998 to 5408
   goals met: 8 of 12
35. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 8 of 12
36. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 12
37. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 5408 to 6068
   goals met: 8 of 12
38. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 9 of 12
39. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   goals met: 8 of 12
40. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   goals met: 8 of 12
41. (walk driver2 s0 p1-0)
   deleted: (at driver2 s0)
   added: (at driver2 p1-0)
   goals met: 7 of 12
42. (walk driver1 s0 p1-0)
   deleted: (at driver1 s0)
   added: (at driver1 p1-0)
   goals met: 7 of 12
43. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   goals met: 7 of 12
44. (walk driver2 p1-0 s1)
   deleted: (at driver2 p1-0)
   added: (at driver2 s1)
   goals met: 7 of 12
45. (walk driver1 p1-0 s1)
   deleted: (at driver1 p1-0)
   added: (at driver1 s1)
   goals met: 8 of 12
46. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   goals met: 9 of 12
47. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 12
48. (walk driver2 s1 p1-2)
   deleted: (at driver2 s1)
   added: (at driver2 p1-2)
   goals met: 8 of 12
49. (walk driver2 p1-2 s2)
   deleted: (at driver2 p1-2)
   added: (at driver2 s2)
   goals met: 8 of 12
50. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 6068 to 6938
   goals met: 9 of 12
51. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 9 of 12
52. (walk driver3 s0 p1-0)
   deleted: (at driver3 s0)
   added: (at driver3 p1-0)
   goals met: 9 of 12
53. (walk driver3 p1-0 s1)
   deleted: (at driver3 p1-0)
   added: (at driver3 s1)
   goals met: 10 of 12
54. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 12
55. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 6938 to 7348
   goals met: 11 of 12
56. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 12 of 12
